InformationRegisters/__НастройкиВебСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__НастройкиВебСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВебСервисИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисВидМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМеню</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисРежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисПериодНеактивностиСеансов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисПериодХраненияНеактивнныхСеансов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПриостановить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПериодИнтервалаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПериодХраненияЗаданий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверКаталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверИдентификаторПубликации</Name>
					<Comment>Идентификатор публикации на web-сервере.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверКаталогПублицкации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверКаталогИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверURLИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/__Изображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>__Изображения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/__НастройкиВебСервиса/Ext/ManagerModule.bsl
Процедура ИзменитьПараметрыПользователяВебСервиса(Активность, Пароль) Экспорт
	
	// Поиск пользователя.
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(__ВебСервисСервер.НастройкаИмяПользователя());
	
	Если Активность И (Пользователь = Неопределено) Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = __ВебСервисСервер.НастройкаИмяПользователя(Ложь);
		Пользователь.ПолноеИмя = НСтр("ru = 'Web-сервис'; uk = 'Web-сервіс'");
	КонецЕсли;
	
	// Настрока пользователя.
	Если (Не Пользователь = Неопределено) Тогда
		Пользователь.АутентификацияСтандартная = Активность;
		Пользователь.АутентификацияОС = Ложь;
		Пользователь.ЗапрещеноИзменятьПароль = Истина;
		Пользователь.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение;
		Пользователь.Роли.Очистить();
			Пользователь.Роли.Добавить(Метаданные.Роли.Touch);
			Пользователь.Роли.Добавить(Метаданные.Роли.Пользователь);
			Пользователь.Роли.Добавить(Метаданные.Роли.__Совместимость); // Совместимость.
		Пользователь.ПоказыватьВСпискеВыбора = Ложь;
		Если (Не Пользователь.ПарольУстановлен) Или (Не Пользователь.СохраняемоеЗначениеПароля = Пароль) тогда
			Пользователь.Пароль = Пароль;
		КонецЕсли;
		Пользователь.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ИзменитьПараметрыПользователяВебСервиса()

Процедура ИзменитьПараметрыПользователяСервераПечати(Активность, Пароль) Экспорт
	
	// Поиск пользователя.
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(__СерверПечатиСервер.НастройкаИмяПользователя());
	
	Если Активность И (Пользователь = Неопределено) Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = __СерверПечатиСервер.НастройкаИмяПользователя(Ложь);
		Пользователь.ПолноеИмя = НСтр("ru = 'Сервер печати'; uk = 'Сервер друку'");
	КонецЕсли;
	
	// Настрока пользователя.
	Если (Не Пользователь = Неопределено) Тогда
		Пользователь.АутентификацияСтандартная = Активность;
		Пользователь.АутентификацияОС = Ложь;
		Пользователь.ЗапрещеноИзменятьПароль = Истина;
		Пользователь.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение;
		Пользователь.Роли.Очистить(); Пользователь.Роли.Добавить(Метаданные.Роли.Server);
		Пользователь.ПоказыватьВСпискеВыбора = Ложь;
		Пользователь.Пароль = Пароль;
		Пользователь.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ИзменитьПараметрыПользователяСервераПечати()


Процедура ИзменитьПараметрыРегламентногоЗаданияСервераПечати(Активность, Период) Экспорт
	
	// Поиск регламентного задания.
	УстановитьПривилегированныйРежим(Истина);
	
	Регламентное = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.СерверПечати);
	
	// Настрока регламентного задания.
	ПериодПовтора = Макс(Период - НачалоДня(Период), 5);
	
	Регламентное.Использование = Активность;
	Регламентное.ИмяПользователя = __СерверПечатиСервер.НастройкаИмяПользователя(Ложь);
	Регламентное.Расписание.ВремяЗавершения = Неопределено;
	Регламентное.Расписание.ВремяКонца = Неопределено;
	Регламентное.Расписание.ВремяНачала = Неопределено;
	Регламентное.Расписание.ДатаКонца = Неопределено;
	Регламентное.Расписание.ДатаНачала = Неопределено;
	Регламентное.Расписание.ДеньВМесяце = Неопределено;
	Регламентное.Расписание.ДеньНеделиВМесяце = Неопределено;
	Регламентное.Расписание.ДетальныеРасписанияДня.Очистить();
	Регламентное.Расписание.ДниНедели.Очистить();
	Регламентное.Расписание.ИнтервалЗавершения = 300; // 5 мин.
	Регламентное.Расписание.Месяцы.Очистить();
	Регламентное.Расписание.ПаузаПовтора = ПериодПовтора;
	Регламентное.Расписание.ПериодНедель = Неопределено;
	Регламентное.Расписание.ПериодПовтораВТечениеДня = ПериодПовтора;
	Регламентное.Расписание.ПериодПовтораДней = 1;
	Регламентное.ИнтервалПовтораПриАварийномЗавершении = Регламентное.Метаданные.ИнтервалПовтораПриАварийномЗавершении;
	Регламентное.КоличествоПовторовПриАварийномЗавершении = Регламентное.Метаданные.КоличествоПовторовПриАварийномЗавершении;
	Регламентное.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ИзменитьПараметрыРегламентногоЗаданияСервераПечати()


Процедура ИзменитьПараметрыКаталогаПублицкации(Активность, Каталог, Оригинал) Экспорт

	Если Активность Тогда
		
		// Проверка.
		Если Не ПустаяСтрока(Оригинал) Тогда 
			Если Не РесурсПублицкацииПроверить(Оригинал) Тогда
				Оригинал = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		// Создание.
		СоздатьКаталог(ПолучитьПутьСтандартаПлатформы(Каталог + "/pic"));
		
		Если ПустаяСтрока(Оригинал) Тогда 
			// Публикация.
			РесурсПублицкацииИзображениеРазместить();
		Иначе
			// Перемещение.
			Если (Не НСтр(Каталог) = НСтр(Оригинал)) Тогда
				РесурсыПублицкацииПереместить(Оригинал, Каталог);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		// Удаление.
		Если Не ПустаяСтрока(Оригинал) Тогда 
			УдалитьФайлы(Оригинал);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ИзменитьПараметрыПользователяСервераПечати()


Функция ПолучитьДоступностьВебСервиса() Экспорт
	
	Возврат РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСервисИспользовать;
	
КонецФункции // ПолучитьДоступностьВебСервиса()

Функция ПолучитьРежимРаботыВебСервиса() Экспорт
	
	Возврат РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСервисРежимРаботы;
	
КонецФункции // ПолучитьРежимРаботыВебСервиса()

Функция ПолучитьВидМенюВебСервиса() Экспорт
	
	Возврат РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСервисВидМеню;
	
КонецФункции // ПолучитьВидМенюВебСервиса()

Функция ПолучитьКаталогИзображенийВебСервера() Экспорт
	
	Возврат РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСерверКаталогИзображений;
	
КонецФункции // ПолучитьКаталогИзображенийВебСервера()


Функция ПолучитьПарольПользователяВебСервиса() Экспорт
	
	// Поиск пользователя.
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(__ВебСервисСервер.НастройкаИмяПользователя());
	
	Если (Пользователь = Неопределено) Или (Не Пользователь.ПарольУстановлен) Тогда
		Результат = __ВебСервисСервер.НастройкаИмяПользователя();
	Иначе
		Результат = Пользователь.СохраняемоеЗначениеПароля;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьПарольПользователяВебСервиса()

Функция ПолучитьПарольПользователяСервераПечати() Экспорт
	
	// Поиск пользователя.
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(__СерверПечатиСервер.НастройкаИмяПользователя());
	
	Результат = Получить().СерверПечатиПароль;
	Если ПустаяСтрока(Результат) Тогда
		Результат = __СерверПечатиСервер.НастройкаИмяПользователя();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьПарольПользователяВебСервиса()


Функция ПолучитьПериодРегламентногоЗаданияСервераПечати() Экспорт
	
	// Поиск регламентного задания.
	УстановитьПривилегированныйРежим(Истина);
	
	Регламентное = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.СерверПечати);
	
	Если Булево(Регламентное.Расписание.ПериодПовтораВТечениеДня) Тогда
		Результат = '0001.01.01 00:00:00' + Макс(Регламентное.Расписание.ПериодПовтораВТечениеДня, 5);
	Иначе
		Результат = '0001.01.01 00:05:00';
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьПериодРегламентногоЗаданияСервераПечати()


Функция ПолучитьГраницуНеактивностиСеансов() Экспорт
	
	// Получение параметров.
	ВебСервисПериодНеактивностиСеансов = РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСервисПериодНеактивностиСеансов;

	// Расчет.
	Результат = ТекущаяДата() - (ВебСервисПериодНеактивностиСеансов - НачалоДня(ВебСервисПериодНеактивностиСеансов));
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьГраницуНеактивностиСеансов()

Функция ПолучитьГраницуХраненияНеактивнныхСенасов() Экспорт
	
	// Получение параметров.
	ВебСервисПериодХраненияНеактивнныхСеансов = РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСервисПериодХраненияНеактивнныхСеансов;

	// Расчет.
	Результат = ТекущаяДата() - (ВебСервисПериодХраненияНеактивнныхСеансов - НачалоДня(ВебСервисПериодХраненияНеактивнныхСеансов));
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьГраницуХраненияНеактивнныхСенасов()

Функция ПолучитьГраницуХраненияЗаданий() Экспорт
	
	// Получение параметров.
	СерверПечатиПериодХраненияЗаданий = РегистрыСведений.__НастройкиВебСервиса.Получить().СерверПечатиПериодХраненияЗаданий;

	// Расчет.
	Результат = ТекущаяДата() - (СерверПечатиПериодХраненияЗаданий - НачалоДня(СерверПечатиПериодХраненияЗаданий));
	
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьГраницуХраненияЗаданий()


Функция РесурсПублицкацииПроверить(Файл) Экспорт
	
	Возврат Булево(НайтиФайлы(Файл).Количество());
	
КонецФункции // РесурсПублицкацииПроверить()

Функция РесурсПублицкацииРазместить(Файл, ДвоичныеДанные, Перезапись = Ложь) Экспорт
	
	Если (Не ДвоичныеДанные = Неопределено) Тогда
		Если Перезапись Или (Не РесурсПублицкацииПроверить(Файл)) Тогда
			ДвоичныеДанные.Записать(Файл);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // РесурсПублицкацииРазместить()

Функция РесурсПублицкацииУдалить(Файл) Экспорт
	
	УдалитьФайлы(Файл);
	
КонецФункции // РесурсПублицкацииУдалить()

Функция РесурсПублицкацииУдалитьКопии(Файл, Каталог, Маска) Экспорт
	
	Имя = НРег(ПолучитьПутьСтандартаПлатформы(Файл));
	
	МассивФайлов = НайтиФайлы(Каталог, Маска);
	Для Каждого Копия Из МассивФайлов Цикл
		Если (Не НРег(Копия.Имя) = Имя) Тогда
			УдалитьФайлы(Копия.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // РесурсПублицкацииУдалить()

Функция РесурсыПублицкацииПолучить(Каталог, Маска) Экспорт
	
	Возврат НайтиФайлы(Каталог, Маска);
	
КонецФункции // РесурсыПублицкацииПолучить()

Процедура РесурсыПублицкацииПереместить(Каталог, Оригинал) Экспорт
	
	
КонецПроцедуры // ПереместитьКаталогПублицкации()


Функция РесурсПублицкацииИзображениеРазместить(ТекущийОбъект = Неопределено) Экспорт
	
	// Параметры.
	Каталог = ПолучитьКаталогИзображенийВебСервера();
	
	// Проверка.
	Если ПустаяСтрока(Каталог) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	// Публикация данных.
	Если (ТекущийОбъект = Неопределено) Тогда
		
		МассивРазмещенныхФайлов = Новый Массив;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	__Изображения.URL КАК URL,
		                      |	__Изображения.Изображение
		                      |ИЗ
		                      |	Справочник.__Изображения КАК __Изображения
		                      |ГДЕ
		                      |	(НЕ __Изображения.ЭтоГруппа)");
		Выборка = Запрос.Выполнить().Выбрать();

		УстановитьПривилегированныйРежим(Ложь);
		
		Пока Выборка.Следующий() Цикл
			РесурсПублицкацииРазместить(Каталог + Выборка.URL, Выборка.Изображение.Получить());
			МассивРазмещенныхФайлов.Добавить(Выборка.URL);
		КонецЦикла;
		
	Иначе
		
		РесурсПублицкацииРазместить(Каталог + ТекущийОбъект.URL, ТекущийОбъект.Изображение.Получить());
		
	КонецЕсли;
	
	// Удаление данных.
	Если (ТекущийОбъект = Неопределено) Тогда
		
		МассивФайлов = НайтиФайлы(Каталог, "*");
		Для Каждого Файл Из МассивФайлов Цикл
			Если (МассивРазмещенныхФайлов.Найти(Файл.Имя) = Неопределено) Тогда
				УдалитьФайлы(Файл.ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		РесурсПублицкацииУдалитьКопии(ТекущийОбъект.URL, Каталог, Лев(ТекущийОбъект.URL, 36) + "*");	
	КонецЕсли;
	
КонецФункции // РесурсПублицкацииИзображениеРазместить()

Процедура РесурсПублицкацииИзображениеСгенерироватьURL(ТекущийОбъект) Экспорт
	
	// Идентификатор.
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Идентификатор) Тогда
		ТекущийОбъект.Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// Расширение.
	Расширение = Новый Файл(ТекущийОбъект.Файл); Расширение = Расширение.Расширение;
	Если ПустаяСтрока(Расширение) Тогда
		Картинка = Новый Картинка(ТекущийОбъект.Изображение.Получить());
		Расширение = "." + Строка(Картинка.Формат());
	КонецЕсли;
	Расширение = НРег(Расширение);
	
	// URL.
	Если ПустаяСтрока(ТекущийОбъект.ВерсияДанных) Тогда
		ТекущийОбъект.URL = "0000000000000000";
	Иначе
		ТекущийОбъект.URL = НРег(СтрЗаменить(Base64Значение(ТекущийОбъект.ВерсияДанных), " ", ""));
	КонецЕсли;
	ТекущийОбъект.URL = Строка(ТекущийОбъект.Идентификатор) + "-" + ТекущийОбъект.URL + Расширение;
	
КонецПроцедуры // РесурсПублицкацииИзображениеСгенерироватьURL()

Процедура РесурсПублицкацииИзображениеСгенерироватьПолеURLЗапроса(Запрос, Поле) Экспорт
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, Поле, "(&КаталогИзображений + " + Поле + ".URL)");
	Если Не Запрос.Параметры.Свойство("КаталогИзображений") Тогда
		Запрос.УстановитьПараметр("КаталогИзображений", РегистрыСведений.__НастройкиВебСервиса.Получить().ВебСерверURLИзображений);
	КонецЕсли;
	
КонецПроцедуры // РесурсПублицкацииИзображениеСгенерироватьПолеURLЗапроса()

Функция РесурсыПублицкацииИзображенийПолучить() Экспорт
	
	МассивФайлов = РесурсыПублицкацииПолучить(ПолучитьКаталогИзображенийВебСервера(), "????????-????-????-????-????????????-????????????????.*");
	
	Для Индекс = 0 По МассивФайлов.ВГраница() Цикл
		МассивФайлов[Индекс] = НРег(МассивФайлов[Индекс].Имя);
	КонецЦикла;
	
	Возврат МассивФайлов;
	
КонецФункции // РесурсыПублицкацииИзображенийПолучить()


Функция ПолучитьПутьСтандартаПлатформы(Путь, Платформа = Неопределено) Экспорт
	
	// Тип платформы.
	Если (Платформа = Неопределено) Тогда
		Платформа = Новый СистемнаяИнформация; Платформа = Платформа.ТипПлатформы;
	КонецЕсли;
	
	Если (Платформа = ТипПлатформы.Linux_x86) Или (Платформа = ТипПлатформы.Linux_x86_64) Тогда
		
		// Linux.
		Возврат СтрЗаменить(Путь, "\", "/");
		
	Иначе
		
		// Windows.
		Возврат СтрЗаменить(Путь, "/", "\");

	КонецЕсли;
	
КонецФункции // ПолучитьПутьСтандартаПлатформы()

Функция ПолучитьКорневойКаталогВебСервера(ВебСервер) Экспорт
	
	// Тип платформы.
	Платформа = Новый СистемнаяИнформация; Платформа = Платформа.ТипПлатформы;
	
	// Windows.
	Если (Платформа = ТипПлатформы.Windows_x86) Или (Платформа = ТипПлатформы.Windows_x86_64) Тогда
		
		// Получение каталога программ.
		КоммандныйФайл = ПолучитьИмяВременногоФайла(".cmd"); РезультирующийФайл = ПолучитьИмяВременногоФайла(".txt");
		
	    ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.ДобавитьСтроку("@echo %PROGRAMFILES%");
		ТекстовыйДокумент.ДобавитьСтроку("@exit");
		ТекстовыйДокумент.Записать(КоммандныйФайл, КодировкаТекста.Системная);
		
		ЗапуститьПриложение(Символ(34) + КоммандныйФайл + Символ(34) + " > " + Символ(34) + РезультирующийФайл + Символ(34), КаталогВременныхФайлов(), Истина);
		
		// Получение каталога программ.
		ТекстовыйДокумент.Прочитать(РезультирующийФайл);
		КаталогПрограмм = ТекстовыйДокумент.ПолучитьСтроку(1);
		
		Если (Платформа = ТипПлатформы.Windows_x86_64) Тогда
			Если (Не НРег(Прав(КаталогПрограмм, 4)) = "(x86)") Тогда
				КаталогПрограмм = КаталогПрограмм + " " + "(x86)";
			КонецЕсли;
		КонецЕсли;
		
		// Удаление временных файлов.
		УдалитьФайлы(КоммандныйФайл); УдалитьФайлы(РезультирующийФайл);
		
	Иначе
		
		// TODO: Linux.
		
	КонецЕсли;
	
	// Apache 2.2.
	Если (ВебСервер = "apache2.2") ИЛИ (ВебСервер = "apache2.4") Тогда
		
		// Канфигурационный файл.
		КанфигурационныйФайл = КаталогПрограмм + ПолучитьПутьСтандартаПлатформы("/Apache Software Foundation/Apache2.2/conf/httpd.conf");
		
		МассивФайлов = НайтиФайлы(КанфигурационныйФайл);
		Если Булево(МассивФайлов.Количество()) Тогда
			ТекстовыйДокумент.Прочитать(КанфигурационныйФайл);
			Конфигурация = ТекстовыйДокумент.ПолучитьТекст();
			
			// DocumentRoot.
			Для Индекс = 1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
				Строка = СокрЛ(ТекстовыйДокумент.ПолучитьСтроку(Индекс));
				Если (НРег(Лев(Строка, 12)) = "documentroot") Тогда
					Результат = СокрЛП(Сред(Строка, 14));
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Переведем на нормальный гражданский язык :)
	Если (Лев(Результат, 1) = Символ(34)) Тогда Результат = Сред(Результат, 2);	КонецЕсли;
	Если (Прав(Результат, 1) = Символ(34)) Тогда Результат = Лев(Результат, СтрДлина(Результат) - 1); КонецЕсли;
	Результат = ПолучитьПутьСтандартаПлатформы(Результат);
	Если (Прав(Результат, 1) = ПолучитьПутьСтандартаПлатформы("/")) Тогда Результат = Лев(Результат, СтрДлина(Результат) - 1); КонецЕсли;
			
	// Результат.
	Возврат Результат;
	
КонецФункции // ПолучитьКорневойКаталогСервера()


// <img alt="2" width="16" height="16" src="data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADsMAAA7DAcdvqGQAAAMsSURBVDhPbZNrSFNhGMffT5Hlcpc8G0ERhWRlZUGBpNBdyqAvTTMriwq7jIjCD2JGBEWUQfd75iydlU2bSRdDLWZrRoqXza1tZ5uucq6cy1s7W/v3nlNGtw8/3j//93n+D+fwvAQA+R3zKSIatoiVQ9bp6kHrTOOAeZYx0Bav7muSKg0qIvq7/o9mfyNJDnoS9OHATkSCZxAJl/4geBbcp50ImObonWUk+feQXwFD5ihVqHclF+FOApEyfAvdQSR0m54lggY0iHAnMGhbynkex6hGQ4QA30uSxHlXAt8uwP+hEJ+7jgGhiwiPnBPgNe/1fyyk4WcQ6FyGtoskie8lbCn9Ztc8A7gjsOr34JpqNq7sikdzzSaATuRprskSPP7u3as9wNdD8BoSDQ/yiYgMdERnhvvS4TDmQJ2bgD5WhSHvAWgK5qOzPouyEZrDCwTvM7sXxblzwDbtwIhnI5y6aZmkv3lM8aBrBXyd2/HJkg2udxeCFL9jG7ymTZQs+O3bEPTmgPPths+aTeu2YtiTDbZyupoMd4w1tmtj4W5cglDPZgTsGxCwpWPAuQEDbAYGf/LFno4v9gyEaU2XYR1atXHoeiR7S/qaoo3uuomoPi6F6eFcjNhXIWBZi35zGvzmNfRcTVkjeF/ZNJhrFqPy6CQ4ayWwlknekp6G6GJfoxw2XSzKDopxP0+B5oo4dNYlwNqwgLKQ/odEtGhn4l7eZJTsE8NSKQPf035DoiY9daLMj89l6Hkuh+epHPXnaYhyMqqWx6MydQYlHlUraPP6Kag9HYPuJwx6GxRwVzNovSTNJNbyKNGHZzGGbh0Dd5Uc71/I4M9ZhOFFaRhalirAa97j77p0cnTrFDDflBmKdowVCYvk1o1L8lRL4LzHwEWDzPun4vWU2TDGzRLgtYl6/FS3VgGLeiIa8sf/WKTRlXRqY1QurTTkoiHsfQavtzComaYQMGyRw1ERSwfQyUWykPHkhD9XeTTEphGnsHelekd5LOzlDN6VUO4wcGgY2KhuuyzVvygYl/LfxzRq1h4WiUxFUmXHdam67arY2HKBck6sflMoUd5K/fc5fwexObaibZ5vTgAAAABJRU5ErkJggg%3D%3D" />

		//Оболочка = Новый COMОбъект("WScript.Shell");
		//Путь = Оболочка.ExpandEnvironmentStrings("%APPDATA%");
		

			//Оболочка = Новый COMОбъект("MSScriptControl.ScriptControl");
			//Оболочка.Language = "vbscript";
			//Оболочка.AddCode("
			//	|Function SpecialFoldersName(Name)
			//	|set Shell=CreateObject(""WScript.Shell"")
			//	|SpecialFoldersName=Shell.SpecialFolders(Name)
			//	|End Function");
			//Путь = НормализоватьКаталог(Оболочка.Run("SpecialFoldersName", "MyDocuments"));
			//ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ИмяПапкиВыгрузки", "ИмяПапкиВыгрузки", Путь);
